StartMilandr/MDR_Pack_v6/SVD_Files/BKP/MDR1986VC1_BKP.svd
<?xml version="1.0" encoding="utf-8"?>

<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd" >
  <vendor>Milandr.</vendor>                                       <!-- device vendor name -->

  <vendorID>Milandr</vendorID>                                    <!-- device vendor short name -->
  <!--#BE1-->  
  <!--name>MDR1986BE1_BKP</name>
  <series>ARMCM1</series-->
  <!--#BE3-->  
  <!--name>MDR1986BE3_BKP</name>
  <series>ARMCM1</series-->
  <!--#BE9x, #VC1-->
  <name>MDR1986VC1_BKP</name>
  <series>ARMCM3</series>
  <!--#BE4, #BK214, #BK234 -->
  <!--name>MDR1986BE4_RST</name>
  <series>ARMCM0</series-->
  
  <version>1.6</version>                                          <!-- version of this description, adding CMSIS-SVD 1.1 tags -->
  <!--description>ARM 32-bit Cortex-M1 Microcontroller based device, CPU clock up to 144MHz, etc. </description--><!--#BE1-->
  <!--description>ARM 32-bit Cortex-M1 Microcontroller based device, CPU clock up to 80MHz, etc. </description--><!--#BE3-->
  <description>ARM 32-bit Cortex-M3 Microcontroller based device, CPU clock up to 80MHz, etc. </description><!--#BE9x-->
  <!--description>ARM 32-bit Cortex-M3 Microcontroller based device with DSP Core, CPU clock up to 100MHz, etc. </description--><!--#VC1-->  
  <!--description>ARM 32-bit Cortex-M0 Microcontroller based device, CPU clock up to 36MHz, etc. </description--><!--#BE4,#BK214,#BK234  -->

  <cpu>                      
    <!--#BE1, #BE3 -->                                     <!-- details about the cpu embedded in the device -->
    <!--name>CM1</name>
    <revision>r1p0</revision-->
    <!--#BE9x,#VC1-->
    <name>CM3</name>
    <revision>r2p1</revision>
    <!--#BE4,#BK214,#BK234-->
    <!--name>CM0</name>
    <revision>r0p0</revision-->

    <endian>little</endian>
    <mpuPresent>false</mpuPresent>
    <fpuPresent>false</fpuPresent>
    <nvicPrioBits>3</nvicPrioBits><!--#BE9x,#VC1-->
    <!--nvicPrioBits>2</nvicPrioBits--><!--#BE1,#BE3,#BE4,#BK214,#BK234-->

    <vendorSystickConfig>false</vendorSystickConfig>
  </cpu>
  <addressUnitBits>8</addressUnitBits>                            <!-- byte addressable memory -->
  <width>32</width>                                               <!-- bus width is 32 bits -->
  <!-- default settings implicitly inherited by subsequent sections -->
  <size>32</size>                                                 <!-- this is the default size (number of bits) of all peripherals
                                                                       and register that do not define "size" themselves -->
  <access>read-write</access>                                     <!-- default access permission for all subsequent registers -->
  <resetValue>0x00000000</resetValue>                             <!-- by default all bits of the registers are initialized to 0 on reset -->
  <resetMask>0xFFFFFFFF</resetMask>                               <!-- by default all 32Bits of the registers are used -->

  <!-- Peripherals -->
  <peripherals>
    <!-- BKP and RTC -->
    <peripheral>
      <name>MDR_BKP</name>
      <version>1.0</version>
      <description>Backup and RTC Control</description>
      <groupName>BKP and RTC</groupName>
      <baseAddress>0x400D8000</baseAddress><!--#BE1,#BE3,#BE9x,#VC1-->
      <!--baseAddress>0x40060000</baseAddress--><!--#BE4,#BK214,#BK234-->

      <size>32</size>
      <access>read-write</access>
      <addressBlock>
        <offset>0</offset>
        <size>0x54</size>
        <usage>registers</usage>
      </addressBlock>

      <registers>
        <!-- REG_x -->
        <register>
          <dim>14</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0,1,2,3,4,5,6,7,8,9,A,B,C,D</dimIndex>
          <name>REG_0%s</name>

          <description>User backup registers</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>

        <!-- REG_0E -->
        <register>
          <name>REG_0E</name>
          <description>REG_OE Control register</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <!--resetMask>0x0000BF7F</resetMask--><!--#BE1,#BE3-->
          <resetMask>0x00007FFF</resetMask><!--#BE9x,#VC1-->
          <!--resetMask>0x0000FFFF</resetMask--><!--#BE4,#BK214,#BK234-->
          <fields>
            <!--LOW-->
            <field>
              <name>LOW</name>
              <description>DUcc Freq control</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_BKP_0E__LOW_</headerEnumName>
                <enumeratedValue>
                  <name>10MHz</name>
                  <description>CPU Clock less then 10MHz</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>200KHz</name>
                  <description>CPU Clock less then 200KHz</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>500KHz</name>
                  <description>CPU Clock less then 500KHz</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1MHz</name>
                  <description>CPU Clock less then 1MHz</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GensOffz</name>
                  <description>Generators Off</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>40MHz</name>
                  <description>CPU Clock less then 40MHz</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>80MHz</name>
                  <description>CPU Clock less then 80MHz</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>above_80MHz</name>
                  <description>CPU Clock above 10MHz</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!--SelectRI-->
            <field>
              <name>SelectRI</name>
              <description>DUcc extra I, should be equals to LOW field!</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_BKP_0E__SelRI_</headerEnumName>
                <enumeratedValue>
                  <name>10MHz</name>
                  <description>Additional I ~ 300uA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>200KHz</name>
                  <description>Additional I ~ 6.6uA</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>500KHz</name>
                  <description>Additional I ~ 20A</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1MHz</name>
                  <description>Additional I ~ 80uA</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GensOffz</name>
                  <description>Additional I ~ 2uA</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>40MHz</name>
                  <description>Additional I ~ 900uA</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>80MHz</name>
                  <description>Additional I ~ 4.4mA</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>above_80MHz</name>
                  <description>Additional I ~ 19mA</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!--StandAlone-->
            <!--#BE1,#BE3-->
            <!--field>
              <name>StandAlone</name>
              <description>Switch to StandAlone mode</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_BKP_0E__StandAlone_</headerEnumName>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Microcontroller mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Switch to interface IC</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field-->
            <!--JtagA-->
            <!--#BE9x,#VC1-->
            <field>
              <name>Jtag_A</name>
              <description>Enable Jtag_A interface</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_BKP_0E__JtagA_</headerEnumName>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            
            <!--JtagB-->
            <!--#BE9x,#VC1-->
            <field>
              <name>Jtag_B</name>
              <description>Enable Jtag_B interface</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_BKP_0E__JtagB_</headerEnumName>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            
